{
  "my engine keeps overheating and the ac stops cooling whenever i m idling at a signal": "Based on your symptoms, it is recommended to check your radiator cooling fan system.\n\nDiagnosis steps:\n1. Test radiator fan operation — Check if the fan is spinning when the engine is hot or the AC is on. If the fan is not spinning, this indicates a problem.\n\n2. Inspect radiator fan motor and relay — If the fan isn't spinning, the motor or its relay could be faulty. A faulty motor or relay will prevent the fan from operating.",
  "my engine keeps overheating": "Based on your symptoms, it is recommended to check your engine's cooling system and fan belt.\n\nDiagnosis steps:\n1. Inspect the fan belt for cuts or wear. Look for visible cracks, fraying, or missing chunks of rubber; a damaged belt can cause the engine to overheat.\n\n2. Check fan belt tension and alignment. The belt should be taut and properly seated on all pulleys; a loose or misaligned belt can reduce cooling efficiency.\n\n3. Check the radiator for blockage or damage. Look for bent fins, debris, or leaks; a blocked or damaged radiator cannot cool the engine properly.\n\n4. Test thermostat operation. The engine should warm up and the thermostat should open to allow coolant flow; a faulty thermostat will prevent proper cooling.",
  "engine overheating": "Based on your symptoms, it is recommended to turn off your engine immediately to prevent further damage and let it cool down before proceeding with any checks.\n\nDiagnosis steps:\n1. Check radiator for blockages or damage — Look for debris like leaves or bugs stuck in the radiator fins, or any visible damage or leaks. Blockages or damage can restrict airflow and cooling.\n\n2. Test thermostat operation — Once the engine has cooled, start it and feel both the upper and lower radiator hoses as it warms up. If the lower hose stays cold while the upper hose gets hot, the thermostat might be stuck closed.\n\n3. Test radiator fan operation — With the engine running and at operating temperature, or with the AC on, observe if the cooling fan is spinning. If the fan is not spinning, it cannot cool the radiator effectively.\n\n4. Inspect radiator fan motor and relay — If the fan isn't spinning, check the fan motor for power and listen for any unusual noises. Also, locate and inspect the radiator fan relay in your car's",
  "o o o": "I'm sorry, I could not find a solution based on your input. Please consult a professional mechanic."
}